app/controllers/competitions_controller.rb

SELECT "arts".* FROM "arts"
SELECT COUNT(*) FROM "arts"
INSERT INTO "competitions" ("challenger_id", "art_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["challenger_id", 1], ["art_id", 2], ["created_at", 2016-08-16 21:21:20 UTC], ["updated_at", 2016-08-16 21:21:20 UTC]]
---
  def new
    if Art.all.size >= 2
      pick_battle_pair
      @competition = Competition.create(art: @competitor, challenger: @challenger)

SELECT  "competitions".* FROM "competitions" WHERE "competitions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "competitions" SET "winner" = $1, "updated_at" = $2 WHERE "competitions"."id" = $3  [["winner", 1], ["updated_at", 2016-08-16 21:21:21 UTC], ["id", 3]]
---
  def create
    @competition = Competition.find(params[:id])
    if @competition.update(winner: params[:winner].to_i)